dotcom07/ARGUS/hardware/xiao-secure-capture/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_SYSTEM_MEMPROT=y
# Use the built-in CA bundle for HTTPS backend validation; no certificate is
# pinned to a development host or stored in the repository.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Wi-Fi/TLS builds exceed the default 1 MiB app partition; keep room for the
# development transport without enabling OTA or any irreversible security mode.
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
# Use the connected USB Serial/JTAG port for both console output and commands.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
# Development default: no irreversible eFuse operation happens here.
# CONFIG_SECURE_BOOT_V2_ENABLED is not set
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# CONFIG_ARGUS_DS_PRODUCTION is not set
